Reports/РейтингЗаполненностиГрупп.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Report>
		<Properties>
			<Name>РейтингЗаполненностиГрупп</Name>
			<Comment>Заполненность групп</Comment>
		</Properties>
	</Report>
</MetaDataObject>

Documents/ЗачислениеВДетскийСад.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ЗачислениеВДетскийСад</Name>
			<Comment>Зачисление в детский сад</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗачисленияИВыпуск</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Группа</Name>
					<Comment>Группа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Группы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗачисления</Name>
					<Comment>Дата зачисления</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Воспитанник</Name>
					<Comment>Воспитанник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Дети</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ_Дети</Name>
					<Comment>Дети</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ребенок</Name>
							<Comment>Ребенок</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Дети</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЗачисления</Name>
							<Comment>Дата зачисления</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРождения</Name>
							<Comment>Дата рождения</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/РейтингЗаполненностиГрупп/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПолеВыбораТипаДиаграммы=ТипДиаграммы.Гистограмма;
	Диаграмма.ТипДиаграммы=ПолеВыбораТипаДиаграммы;
КонецПроцедуры

&НаКлиенте
Процедура ПолеВыбораТипаДиаграммыПриИзменении(Элемент)
	Диаграмма.ТипДиаграммы=ПолеВыбораТипаДиаграммы;
КонецПроцедуры

&НаСервере
Процедура КомандаСформироватьДиаграммуНаСервере()
	ЗапросДанных=Новый Запрос;
	ЗапросДанных.Текст=
	"ВЫБРАТЬ
	|	ЗачислениеВДетскийСад.Группа КАК Группа,
	|	КОЛИЧЕСТВО(ЗачислениеВДетскийСад.Воспитанник) КАК Заполненность
	|ИЗ
	|	Документ.ЗачислениеВДетскийСад КАК ЗачислениеВДетскийСад
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗачислениеВДетскийСад.Группа
	|
	|УПОРЯДОЧИТЬ ПО
	|	Заполненность УБЫВ";
	ВыборкаДанных=ЗапросДанных.Выполнить().Выбрать();
	
	Диаграмма.Обновление=Ложь;
	Диаграмма.АвтоТранспонирование=Ложь;
	
	ТочкаДиаграммы=Диаграмма.УстановитьТочку("Заполненность");
	
	Пока ВыборкаДанных.Следующий()Цикл
		ТекущаяСерияДиаграммы=Диаграмма.УстановитьСерию(ВыборкаДанных.Группа);
		Диаграмма.УстановитьЗначение(ТочкаДиаграммы, ТекущаяСерияДиаграммы, ВыборкаДанных.Заполненность);
	КонецЦикла;
	Диаграмма.Обновление=Истина;
	Диаграмма.АвтоТранспонирование=Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомандаСформироватьДиаграмму(Команда)
	КомандаСформироватьДиаграммуНаСервере();
КонецПроцедуры
